; domain
;; =====================================================================
;; Zadanie 2: Robot odkurzajacy
;; Domena: robot porusza sie miedzy pokojami i je sprzata.
;; =====================================================================
(define (domain vacuum-robot)

  (:requirements :strips :typing :negative-preconditions)

  (:types robot room)

  (:predicates
    (at    ?r - robot ?p - room)   ; robot znajduje sie w pokoju
    (dirty ?p - room)              ; pokoj brudny
    (clean ?p - room)              ; pokoj czysty
  )

  ;; Akcja move: robot przemieszcza sie z jednego pokoju do drugiego.
  ;; Brak predykatu polaczen -- robot moze przejsc miedzy dowolnymi pokojami
  ;; (uproszczony model, jak w zadaniu 3).
  (:action move
    :parameters (?r - robot ?from - room ?to - room)
    :precondition (at ?r ?from)
    :effect (and (not (at ?r ?from))
                 (at ?r ?to))
  )

  ;; Akcja clean: sprzata pokoj, w ktorym aktualnie jest robot.
  ;; Wymaga, zeby pokoj byl brudny -- inaczej akcja niedostepna.
  (:action clean
    :parameters (?r - robot ?p - room)
    :precondition (and (at ?r ?p) (dirty ?p))
    :effect (and (not (dirty ?p))
                 (clean ?p))
  )
)

; problem
;; =====================================================================
;; Problem: 3 brudne pokoje, robot startuje w pokoj1.
;; Cel: wszystkie pokoje czyste.
;; =====================================================================
(define (problem clean-three-rooms)
  (:domain vacuum-robot)

  (:objects
    rumba                 - robot
    pokoj1 pokoj2 pokoj3  - room
  )

  (:init
    (at rumba pokoj1)
    (dirty pokoj1)
    (dirty pokoj2)
    (dirty pokoj3)
  )

  (:goal (and
    (clean pokoj1)
    (clean pokoj2)
    (clean pokoj3)
  ))
)

; plan
1. (clean rumba pokoj1)
   deleted: (dirty pokoj1)
   added: (clean pokoj1)
   goals met: 1 of 3
2. (move rumba pokoj1 pokoj3)
   deleted: (at rumba pokoj1)
   added: (at rumba pokoj3)
   goals met: 1 of 3
3. (clean rumba pokoj3)
   deleted: (dirty pokoj3)
   added: (clean pokoj3)
   goals met: 2 of 3
4. (move rumba pokoj3 pokoj2)
   deleted: (at rumba pokoj3)
   added: (at rumba pokoj2)
   goals met: 2 of 3
5. (clean rumba pokoj2)
   deleted: (dirty pokoj2)
   added: (clean pokoj2)
   goals met: 3 of 3
